# ╔══════════════════════════════════════════════════════════╗
# ║  Brewfile - Zer0Dots                                    ║
# ║  chezmoi managed · brew bundle --file=~/.Brewfile       ║
# ╚══════════════════════════════════════════════════════════╝

# -----------------------------------------------------------
# Taps
# -----------------------------------------------------------
tap "dart-lang/dart"
tap "ddev/ddev"
tap "felixkratz/formulae"
tap "gromgit/fuse"
tap "hashicorp/tap"
tap "koekeishiya/formulae"
tap "nikitabobko/tap"
tap "olets/tap"
tap "pantheon-systems/external"
tap "rbenv/tap"
tap "rigellute/tap"
tap "sass/sass"
tap "stripe/stripe-cli"
tap "teamookla/speedtest"
tap "veeso/termscp"

# -----------------------------------------------------------
# Shell & Terminal
# -----------------------------------------------------------
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "bash"
brew "bash-completion"
brew "fish"
brew "starship"
brew "tmux"
brew "olets/tap/zsh-abbr"

# -----------------------------------------------------------
# Editor
# -----------------------------------------------------------
brew "neovim"

# -----------------------------------------------------------
# Window Management & Bar
# -----------------------------------------------------------
cask "nikitabobko/tap/aerospace"
brew "felixkratz/formulae/sketchybar"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
cask "karabiner-elements"

# -----------------------------------------------------------
# Core CLI Tools
# -----------------------------------------------------------
brew "bat"
brew "btop"
brew "coreutils"
brew "curl"
brew "eza"
brew "fd"
brew "fzf"
brew "git"
brew "gh"
brew "gnu-sed"
brew "htop"
brew "jq"
brew "yq"
brew "less"
brew "most"
brew "ripgrep"
brew "the_silver_searcher"
brew "tree"
brew "trash"
brew "wget"
brew "zoxide"

# -----------------------------------------------------------
# File Management & Navigation
# -----------------------------------------------------------
brew "yazi"
brew "midnight-commander"
brew "rsync"
brew "unar"
brew "universal-ctags"

# -----------------------------------------------------------
# Git Tools
# -----------------------------------------------------------
brew "diff-so-fancy"
brew "git-quick-stats"
brew "lazygit"
brew "onefetch"

# -----------------------------------------------------------
# Dev Tools & Languages
# -----------------------------------------------------------
brew "asdf"
brew "chezmoi"
brew "cmake"
brew "cloc"
brew "deno"
brew "gcc"
brew "node"
brew "node@22"
brew "openjdk"
brew "perl"
brew "python@3.11"
brew "python@3.12"
brew "python@3.13"
brew "rust"
brew "yarn"

# -----------------------------------------------------------
# PHP & Web Dev
# -----------------------------------------------------------
brew "php", restart_service: :changed
brew "composer"
brew "sass/sass/sass"
brew "prettier"
brew "markdownlint-cli2"

# -----------------------------------------------------------
# Database
# -----------------------------------------------------------
brew "postgresql@17", restart_service: :changed
brew "redis"
brew "memcached"
brew "pgcli"

# -----------------------------------------------------------
# Docker & DevOps
# -----------------------------------------------------------
brew "lazydocker"
brew "hadolint"
brew "hivemind"
brew "overmind"
brew "ansible"
brew "flyctl"
brew "ddev/ddev/ddev"
brew "stripe/stripe-cli/stripe"
brew "gromgit/fuse/sshfs-mac"

# -----------------------------------------------------------
# API & Networking
# -----------------------------------------------------------
brew "httpie"
brew "posting"
brew "nmap"
brew "telnet"
brew "lynx"
brew "w3m"
brew "mosquitto"
brew "openapi-generator"
brew "swagger-codegen"
brew "teamookla/speedtest/speedtest"

# -----------------------------------------------------------
# Media & Documents
# -----------------------------------------------------------
brew "ffmpegthumbnailer"
brew "ghostscript"
brew "gifsicle"
brew "graphviz"
brew "hugo"
brew "imagemagick"
brew "jhead"
brew "media-info"
brew "pandoc"
brew "pillow"
brew "poppler"
brew "vips"

# -----------------------------------------------------------
# AI & Music
# -----------------------------------------------------------
brew "ollama"
brew "spicetify-cli"
brew "spotifyd", restart_service: :changed
brew "rigellute/tap/spotify-tui"

# -----------------------------------------------------------
# Security & SSH
# -----------------------------------------------------------
brew "certbot"
brew "gnupg"
brew "pinentry-mac"
brew "ssh-copy-id"
brew "sshpass"

# -----------------------------------------------------------
# Misc CLI
# -----------------------------------------------------------
brew "advancecomp"
brew "asciidoctor"
brew "awscli"
brew "cabextract"
brew "docutils"
brew "dos2unix"
brew "doxygen"
brew "esptool"
brew "f3"
brew "fastfetch"
brew "fontforge"
brew "fonttools"
brew "goread"
brew "highlight"
brew "mas"
brew "ossp-uuid"
brew "pstree"
brew "rlwrap"
brew "shellcheck"
brew "shfmt"
brew "tealdeer"
brew "urlview"
brew "wordnet"
brew "yamllint"
brew "pantheon-systems/external/terminus"
brew "rbenv/tap/openssl@1.0"
brew "veeso/termscp/termscp"

# -----------------------------------------------------------
# Casks (GUI Apps)
# -----------------------------------------------------------
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
cask "iterm2"
cask "maccy"
cask "ngrok"
cask "obsidian"
cask "telegram"
cask "visual-studio-code"
cask "whatsapp"
cask "whisky"

# -----------------------------------------------------------
# Mac App Store
# -----------------------------------------------------------
mas "Bitwarden", id: 1352778147
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Slack", id: 803453959
mas "Tailscale", id: 1475387142
mas "WhatsApp", id: 310633997
