tap "dart-lang/dart"
tap "ddev/ddev"
tap "felixkratz/formulae"
tap "nikitabobko/tap"
tap "pantheon-systems/external"
tap "sass/sass"
tap "veeso/termscp"
brew "bat"
brew "btop"
brew "certbot"
brew "chezmoi"
brew "curl"
brew "php", restart_service: :changed
brew "composer"
brew "docker"
brew "eza"
brew "fastfetch"
brew "fd"
brew "fzf"
brew "git"
brew "neovim"
brew "node"
brew "node@22"
brew "posting"
brew "ripgrep"
brew "starship"
brew "yazi"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "ddev/ddev/ddev"
brew "pantheon-systems/external/terminus"
brew "sass/sass/sass"
brew "veeso/termscp/termscp"
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
