tap "cartr/qt4"
tap "dart-lang/dart"
tap "ddev/ddev"
tap "felixkratz/formulae"
tap "hashicorp/tap"
tap "koekeishiya/formulae"
tap "nikitabobko/tap"
tap "olets/tap"
tap "pantheon-systems/external"
tap "rbenv/tap"
tap "sass/sass"
tap "stripe/stripe-cli"
tap "teamookla/speedtest"
brew "advancecomp"
brew "git"
brew "asdf"
brew "python@3.13"
brew "awscli"
brew "bash"
brew "bash-completion"
brew "libgit2"
brew "bat"
brew "btop"
brew "cabextract"
brew "certifi", link: false
brew "chezmoi"
brew "coreutils"
brew "cryptography", link: false
brew "curl"
brew "diff-so-fancy"
brew "eza"
brew "f3"
brew "fastfetch"
brew "fd"
brew "fish"
brew "freetds"
brew "fzf"
brew "gcc"
brew "gh"
brew "gnu-sed"
brew "libusb"
brew "gnupg"
brew "goread"
brew "imagemagick"
brew "jq"
brew "lazygit"
brew "libyaml"
brew "memcached"
brew "neovim"
brew "node"
brew "node@22"
brew "onefetch"
brew "openjdk"
brew "perl"
brew "php", restart_service: :changed
brew "pinentry-mac"
brew "pkgconf"
brew "poppler"
brew "postgresql@17"
brew "python@3.12"
brew "redis"
brew "ripgrep"
brew "rust"
brew "starship"
brew "stow"
brew "tmux"
brew "tree"
brew "zlib"
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"
brew "olets/tap/zsh-abbr"
cask "nikitabobko/tap/aerospace"
cask "font-jetbrains-mono-nerd-font"
cask "bitwarden"
cask "caffeine"
cask "iterm2"
cask "karabiner-elements"
cask "maccy"
cask "obsidian"
cask "sf-symbols"
